; domain
(define (domain emergency)

(:requirements :strips :typing :equality :action-costs)

(:types 
  waypoint - object 
  depot - waypoint
  meeting-place - depot
  ;agent is supertype of turtlebot and drone
  agent - object
  turtlebot drone - agent
  person - object
  box - object)

(:predicates
  (at ?agent - agent ?waypoint - waypoint)
  (handled ?person - person)
  (free ?box - box)
  (empty ?agent - agent)
  (carrying ?agent - agent ?box - box))

;move-durations will be different for turtlebot/drone, hence the agent parameter
;additionally drone cannot move to all places
(:functions (move-duration ?agent - agent ?from ?to - waypoint) - number
            (total-cost) - number)

(:action move
  :parameters (?agent - agent ?from ?to - waypoint)
  :precondition (at ?agent ?from)
  :effect (and (increase (total-cost) (move-duration ?agent ?from ?to))
               (not (at ?agent ?from))
               (at ?agent ?to)))

;only drone can do pick-up, from a known waypoint
(:action pick-up
  :parameters (?drone - drone ?box - box ?waypoint - waypoint)
  :precondition (and (at ?drone ?waypoint)
                  (at ?box ?waypoint)
                  (empty ?drone)
                  (free ?box))
  :effect (and (carrying ?drone ?box)
               (not (empty ?drone))
               (not (free ?box))))

(:action hand-over
  :parameters (?drone - drone ?turtlebot - turtlebot ?box - box ?waypoint - meeting-place)
  :precondition (and (at ?drone ?waypoint)
                     (at ?turtlebot ?waypoint)
                     (carrying ?drone ?box)
                     (empty ?turtlebot))
  :effect (and (not (carrying ?drone ?box))
               (carrying ?turtlebot ?box)
               (empty ?drone)
               (not (empty ?turtlebot))))

(:action deliver
  :parameters (?turtlebot - turtlebot ?box - box ?waypoint - waypoint ?person - person)
  :precondition (and (carrying ?turtlebot ?box)
                     (at ?turtlebot ?waypoint)
                     (at ?person ?waypoint))
  :effect (and (not (carrying ?turtlebot ?box))
               (empty ?turtlebot)
               (not (free ?box))
               (handled ?person))))

; problem
(define (problem emergency-template)
(:domain emergency)
(:objects 
  drone1 - drone
  turtlebot1 - turtlebot
  w x y z - waypoint
  a b c d - depot
  meeting-place - meeting-place
  box1 box2 box3 box4 - box
  person1 person2 person3 person4 - person)

(:init 
  (= (total-cost) 0)

  (= (move-duration drone1 meeting-place a) 1)
  (= (move-duration drone1 meeting-place b) 3)
  (= (move-duration drone1 meeting-place c) 3)
  (= (move-duration drone1 meeting-place d) 1)

  (= (move-duration drone1 a meeting-place) 1)
  (= (move-duration drone1 b meeting-place) 3)
  (= (move-duration drone1 c meeting-place) 3)
  (= (move-duration drone1 d meeting-place) 1)

  (= (move-duration turtlebot1 w meeting-place) 10)
  (= (move-duration turtlebot1 meeting-place w) 10)

  (= (move-duration turtlebot1 y meeting-place) 20)
  (= (move-duration turtlebot1 meeting-place y) 20)

  (= (move-duration turtlebot1 x meeting-place) 10)
  (= (move-duration turtlebot1 meeting-place x) 10)

  (= (move-duration turtlebot1 z meeting-place) 10)
  (= (move-duration turtlebot1 meeting-place z) 10)

  (free box1)
  (free box2)
  (free box3)
  (free box4)

  (at box1 a)
  (at box2 b)
  (at box3 c)
  (at box4 d)

  (empty turtlebot1)
  (empty drone1)

  (at drone1 meeting-place)
  (at turtlebot1 meeting-place)
  
  (at person1 w)
  (at person2 x)
  (at person3 y)
  (at person4 z))

(:goal (and (handled person1)
            (handled person2)
            (handled person3)
            (handled person4)))

(:metric minimize (total-cost)))

; plan
1. (move drone1 meeting-place d)
   deleted: (at drone1 meeting-place)
   added: (at drone1 d)
   goals met: 0 of 4
2. (pick-up drone1 box4 d)
   deleted: (empty drone1) (free box4)
   added: (carrying drone1 box4)
   goals met: 0 of 4
3. (move drone1 d meeting-place)
   deleted: (at drone1 d)
   added: (at drone1 meeting-place)
   goals met: 0 of 4
4. (hand-over drone1 turtlebot1 box4 meeting-place)
   deleted: (carrying drone1 box4) (empty turtlebot1)
   added: (carrying turtlebot1 box4) (empty drone1)
   goals met: 0 of 4
5. (move drone1 meeting-place b)
   deleted: (at drone1 meeting-place)
   added: (at drone1 b)
   goals met: 0 of 4
6. (move turtlebot1 meeting-place w)
   deleted: (at turtlebot1 meeting-place)
   added: (at turtlebot1 w)
   goals met: 0 of 4
7. (pick-up drone1 box2 b)
   deleted: (empty drone1) (free box2)
   added: (carrying drone1 box2)
   goals met: 0 of 4
8. (move drone1 b meeting-place)
   deleted: (at drone1 b)
   added: (at drone1 meeting-place)
   goals met: 0 of 4
9. (deliver turtlebot1 box4 w person1)
   deleted: (carrying turtlebot1 box4)
   added: (empty turtlebot1) (handled person1)
   goals met: 1 of 4
10. (move turtlebot1 w meeting-place)
   deleted: (at turtlebot1 w)
   added: (at turtlebot1 meeting-place)
   goals met: 1 of 4
11. (hand-over drone1 turtlebot1 box2 meeting-place)
   deleted: (carrying drone1 box2) (empty turtlebot1)
   added: (carrying turtlebot1 box2) (empty drone1)
   goals met: 1 of 4
12. (move drone1 meeting-place c)
   deleted: (at drone1 meeting-place)
   added: (at drone1 c)
   goals met: 1 of 4
13. (move turtlebot1 meeting-place x)
   deleted: (at turtlebot1 meeting-place)
   added: (at turtlebot1 x)
   goals met: 1 of 4
14. (pick-up drone1 box3 c)
   deleted: (empty drone1) (free box3)
   added: (carrying drone1 box3)
   goals met: 1 of 4
15. (move drone1 c meeting-place)
   deleted: (at drone1 c)
   added: (at drone1 meeting-place)
   goals met: 1 of 4
16. (deliver turtlebot1 box2 x person2)
   deleted: (carrying turtlebot1 box2)
   added: (empty turtlebot1) (handled person2)
   goals met: 2 of 4
17. (move turtlebot1 x meeting-place)
   deleted: (at turtlebot1 x)
   added: (at turtlebot1 meeting-place)
   goals met: 2 of 4
18. (hand-over drone1 turtlebot1 box3 meeting-place)
   deleted: (carrying drone1 box3) (empty turtlebot1)
   added: (carrying turtlebot1 box3) (empty drone1)
   goals met: 2 of 4
19. (move turtlebot1 meeting-place z)
   deleted: (at turtlebot1 meeting-place)
   added: (at turtlebot1 z)
   goals met: 2 of 4
20. (move drone1 meeting-place a)
   deleted: (at drone1 meeting-place)
   added: (at drone1 a)
   goals met: 2 of 4
21. (pick-up drone1 box1 a)
   deleted: (empty drone1) (free box1)
   added: (carrying drone1 box1)
   goals met: 2 of 4
22. (move drone1 a meeting-place)
   deleted: (at drone1 a)
   added: (at drone1 meeting-place)
   goals met: 2 of 4
23. (deliver turtlebot1 box3 z person4)
   deleted: (carrying turtlebot1 box3)
   added: (empty turtlebot1) (handled person4)
   goals met: 3 of 4
24. (move turtlebot1 z meeting-place)
   deleted: (at turtlebot1 z)
   added: (at turtlebot1 meeting-place)
   goals met: 3 of 4
25. (hand-over drone1 turtlebot1 box1 meeting-place)
   deleted: (carrying drone1 box1) (empty turtlebot1)
   added: (carrying turtlebot1 box1) (empty drone1)
   goals met: 3 of 4
26. (move turtlebot1 meeting-place y)
   deleted: (at turtlebot1 meeting-place)
   added: (at turtlebot1 y)
   goals met: 3 of 4
27. (deliver turtlebot1 box1 y person3)
   deleted: (carrying turtlebot1 box1)
   added: (empty turtlebot1) (handled person3)
   goals met: 4 of 4
